In [1]:
#Data analysis videoGames:

import pandas as pd

In [50]:
#Import file:
data = pd.read_csv('Resources/purchase_data_homework_py_1.csv')

#data visualitation:
data.head()

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price,Gender_No
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,1
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,1
2,2,Ithergue48,24,Male,92,Final Critic,4.88,1
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,1
4,4,Iskosia90,23,Male,131,Fury,1.44,1

In [28]:
#Player Count

players = data.SN.nunique()
players

#The total number of players:

576

In [10]:
#------------------------------------------Purchasing analysis------------------------------------------------------

price_avg = data['Price'].mean()
price_avg

#average purchase price:

3.050987179487176

In [12]:
#Total Number of Purchases

revenue = data['Price'].count()
revenue

#The total number of Purchases is:

780

In [13]:
 #Total Revenue

revenue = data['Price'].sum()
revenue

#The total revenue is:

2379.77

In [ ]:
#-------------------------------------Gender Demographics---------------------------------------------------------
#Percentage and count of male Players
#Percentage and count of famale Players
#Percentage and Count of Other / Non-Disclosed

In [96]:
unique_users = data['SN'].nunique()

group_genders = data.groupby('Gender').nunique()
group_genders = group_genders.drop(columns=['Purchase_ID','Age','Gender','Item_ID','Item_Name','Price','Gender_No'])
group_genders['Percentage']= group_genders['SN']/unique_users
group_genders

                        SN  Percentage
Gender
Female                  81    0.140625
Male                   484    0.840278
Other / Non-Disclosed   11    0.019097

In [ ]:
#-------------------------------------Purchasing Analysis (Gender)---------------------------------------------------------

#Broken by gender the next information
#Purchase Count
#Average Purchase Price
#Total Purchase Value
#Average Purchase Total per Person by Gender

In [56]:
purchase_count = pd.crosstab(data.Gender, data.Purchase_ID.count())
purchase_count

col_0                  780
Gender
Female                 113
Male                   652
Other / Non-Disclosed   15

In [71]:
avr_price = data.groupby('Gender')['Price'].mean()
avr_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [72]:
total_purchase = data.groupby('Gender')['Price'].sum()
total_purchase

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [ ]:
#-------------------------------------Age Demographics---------------------------------------------------------

#broken by age <10, 10 - 14, 15 - 19...n)
#Purchase count
#Average Purchase Price
#Total Purchase Value

In [75]:
data.groupby(pd.cut(data['Age'], range(0, 50,4)))['Price'].count()

Age
(0, 4]        0
(4, 8]       17
(8, 12]      28
(12, 16]     71
(16, 20]    170
(20, 24]    266
(24, 28]     88
(28, 32]     63
(32, 36]     42
(36, 40]     28
(40, 44]      6
(44, 48]      1
Name: Price, dtype: int64

In [77]:
data.groupby(pd.cut(data['Age'], range(0, 50,4)))['Price'].mean()

Age
(0, 4]           NaN
(4, 8]      3.462353
(8, 12]     3.024643
(12, 16]    2.993944
(16, 20]    3.123529
(20, 24]    3.006541
(24, 28]    2.929205
(28, 32]    3.052222
(32, 36]    2.895952
(36, 40]    3.560357
(40, 44]    3.305000
(44, 48]    1.700000
Name: Price, dtype: float64

In [78]:
data.groupby(pd.cut(data['Age'], range(0, 50,4)))['Price'].sum()

Age
(0, 4]        0.00
(4, 8]       58.86
(8, 12]      84.69
(12, 16]    212.57
(16, 20]    531.00
(20, 24]    799.74
(24, 28]    257.77
(28, 32]    192.29
(32, 36]    121.63
(36, 40]     99.69
(40, 44]     19.83
(44, 48]      1.70
Name: Price, dtype: float64

In [ ]:
#-------------------------------------Top Spenders---------------------------------------------------------

#Identify the top 5 spenders
#SN
#Purchase Count
#Average Purchase Price
#Total Purchase Value

In [90]:
user_group = data.groupby('SN')
total_purchase = user_group.sum()['Price']
purchase_count = user_group.count()['Price']
purchase_mean = user_group.mean()['Price']

top_spenders = pd.DataFrame({'Purchase_Count': purchase_count, 'Purchase_mean': purchase_mean,
                            'Total_Purchase_Value': total_purchase})

#DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last'


top_spenders.sort_values('Total_Purchase_Value', ascending=False).head()

             Purchase_Count  Purchase_mean  Total_Purchase_Value
SN
Lisosia93                 5       3.792000                 18.96
Idastidru52               4       3.862500                 15.45
Chamjask73                3       4.610000                 13.83
Iral74                    4       3.405000                 13.62
Iskadarya95               3       4.366667                 13.10

In [ ]:
#-------------------------------------Most Popular Items---------------------------------------------------------

#Identify the 5 most popular items
#Item ID
#Item Name
#Purchase Count
#Price
#Total Purchase Value

In [91]:
item_popular = data.groupby('Item_ID')
total_purchase = item_popular.sum()['Price']
purchase_count = item_popular.count()['Price']
purchase_mean = item_popular.mean()['Price']

top_items = pd.DataFrame({'Purchase_Count': purchase_count, 'Purchase_mean': purchase_mean,
                            'Total_Purchase_Value': total_purchase})

#DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last'


top_items.sort_values('Total_Purchase_Value', ascending=False).head()

         Purchase_Count  Purchase_mean  Total_Purchase_Value
Item_ID
178                  12           4.23                 50.76
82                    9           4.90                 44.10
145                   9           4.58                 41.22
92                    8           4.88                 39.04
103                   8           4.35                 34.80